testCase/ballPrecribedTranslation/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;


dynamicFvMesh       oversetAndAMRFvMesh; 
//dynamicFvMesh       dynamicOversetFvMesh;

oversetAndAMRFvMeshCoeffs
{

maskThickness 0.1;

nBufferLayersR 4;

// How often to refine
refineInterval  1;

// Field to be refinement on
field           refinementField; //cellMask;
//field   cellMask;


// Refine field inbetween lower..upper
lowerRefineLevel 0.001; //0.001;
upperRefineLevel 1.5; //0.999;

// If value < unrefineLevel unrefine
unrefineLevel   0.25;

// Have slower than 2:1 refinement
nBufferLayers   2;

// Refine cells only up to maxRefinement levels
maxRefinement   3;

// Stop refinement if maxCells reached
maxCells        200000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
//    (phi U)
//    (nHatf none)
//    (rhoPhi none)
//    (alphaPhi0.water none)
//    (ghf none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;

}

motionSolverLibs ("libsixDoFRigidBodyMotion.so");

//solver   banana; //sixDoFRigidBodyMotion;


sixDoFRigidBodyMotionCoeffs
 {
     patches         (ballIn);
     innerDistance   0.07;
     outerDistance   0.1;
     centreOfMass    (0 0 0 );
     mass            0.155;
     momentOfInertia ( 7.6e-5 7.6e-5 7.6e-5);
     velocity        ( 30 0 0 );
     rhoName         rhoInf;
	 rho             rhoInf;
     rhoInf          1.0;
     accelerationRelaxation 0.9;
     accelerationDamping 0.95;
     report          on;
     reportToFile    on;
     solver
     {
         type            CrankNicolson;
     }
     constraints
     {
         twoDmotionOnly
        {
            sixDoFRigidBodyMotionConstraint   plane;
            normal                            (0 0 1);
    	}

		 noRotation
		 {
   		sixDoFRigidBodyMotionConstraint   axis;
   		axis                              (0 0 1);
		 }


     }
     restraints
     {
     }
 }


solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    front
    {
        solidBodyMotionFunction linearMotion; //rotatingMotion;
		velocity (30 0 0);
    }
}


// ************************************************************************* //
